{
    "projects": [
        {
            "srcImg":"https://user-images.githubusercontent.com/60759188/210115599-a0380659-f8a9-4296-a3a6-527d0edfb783.png", 
            "github":"https://github.com/TheOnlyFastCoder2/TrainerBrain", 
            "website":"https://trainer-brain.vercel.app/"
        },
        {
            "srcImg":"https://user-images.githubusercontent.com/60759188/210270546-a963a477-2c9c-4890-b148-44e900aca252.png", 
            "github":"https://github.com/TheOnlyFastCoder2/DynamicKeyBoarding", 
            "website":"https://dynamic-key-boarding.vercel.app/"
        }
    ],
    "aboutMe": {
        "story": {
            "headline": "С чего начиналась моя дорога",
            "text": "В возрасте 22 года я уже обладаю хорошим опытом и знаниями в различных сферах. Я закончил специальность техник-теплотехник, однако во время свободного времени увлечённо занимался web-дизайном и web-разработкой, используя такие технологии, как React, Tauri и Electron для создания кроссплатформенных приложений. Отслужил срочную службу в армии, я получил профессию повара 3-го разряда. В будущем я хочу больше времени уделять разработке сайтов и web-приложений на основе ASMR-технологии. Это позволит мне создавать более совершенные продукты, которые будут востребованы на рынке. Кроме того, это направление кажется мне очень перспективным, и я уверен, что смогу добиться в нём успеха.                     Я готов приложить все усилия, чтобы освоить различные инструменты web-разработки и использовать их для создания качественных продуктов."
        },
        "skills": [
            ["JS/TS","Я выбрал JavaScript как язык программирования своей первой любви. Для меня он идеален, потому что его функциональный и объектно-ориентированный подход позволяют создавать краткий и лаконичный код. Это делает его идеальным для написания чистых и модульных алгоритмов. JavaScript также имеет богатую коллекцию библиотек и фреймворков, которые упрощают разработку интерактивных приложений. Например, React, Angular и Vue.js - это только некоторые из наиболее популярных технологий, которые позволяют создавать сложные и интуитивно понятные пользователю интерфейсы.  TypeScript - это ценная добавка к JavaScript, которая делает его еще более мощным инструментом для разработки интерактивных приложений. Он обеспечивает четкую типизацию переменных, позволяя точно определить их значение и поведение. Кроме того, он позволяет описать сложные объекты и функции, что делает код более понятным и управляемым.             Но главное преимущество TypeScript - это его способность выявлять ошибки на этапе компиляции."],
            ["React", "Когда я впервые наткнулся на React и принцип компонентного подхода, мне он показался  идеальным инструментом для построения сложных интерфейсов, позволяя мне легко разбить их на более мелкие и управляемые части, что делает код более понятным и легким. Одна не из последних причин почему я выбрал React - это его способность рендерить интерфейс на основе динамических данных без участия DOM - такой подход позволяет мне сосредоточиться на написании качественного кода, а не на манипулировании DOM-элементами. Наконец, полная поддержка TypeScript - это то, чего я всегда хотел от фреймворка: безопасности и стабильности в моем коде. И, наконец, большое сообщество разработчиков React - это то, что делает этот фреймворк таким привлекательным для меня."],
            ["SCSS/TailWind", "Я не использовал бы Tailwind, если бы не смог интегрировать его в CSS/SCSS файлы - это позволяет мне сохранить чистоту и организованность в JSX-файлах, избавившись от накопленных стилей и создав более читаемый и поддерживаемый код. Мне нравится Tailwind CSS из-за его современной системы управления стилями, которая позволяет легко воспользоваться наборами готовых решений для часто встречающихся задач. Одним из наиболее полезных аспектов Tailwind является возможность использовать префиксы md:, sm:, lg: и т.д. для указания размеров экрана и динамических стилей. Это позволяет писать более краткий и понятный CSS-код, а также упрощает процесс адаптации интерфейса под различные устройства."]
        ]
    },
    "contacts": {
        "vk": "https://vk.com/po_sasha",
        "telegram": "https://t.me/QtyPyDevox",
        "github": "https://github.com/TheOnlyFastCoder2",
        "discord": "https://discord.gg/5MWnNM8Y"
    }
}